app/Controllers/EmpleadoController.php

        public function index(): string
        {
            //Creamos un objeto de tipo EmpleadosModel
            $empleado = new EmpleadosModel();

            // Realizamos la busqueda con el findAll
            $datos['datos']=$empleado->findAll(); // Select * from empleados
---
SELECT *
FROM `empleados`

        public function agregarEmpleado(){
            //Creamos un objeto de tipo EmpleadosModel
            $empleado = new EmpleadosModel();
            $datos=[
                'empleado_id'=>$this->request->getPost('txt_id'),
                'nombre'=>$this->request->getPost('txt_nombre'),
                'apellido'=>$this->request->getPost('txt_apellido'),
                'telefono'=>$this->request->getPost('txt_telefono'),
                'puesto_id'=>$this->request->getPost('txt_puesto_id'),
                'fecha_nacimiento'=>$this->request->getPost('txt_fecha_nacimiento')
            ];

            $empleado->insert($datos);
---
INSERT INTO `empleados` (`empleado_id`, `nombre`, `apellido`, `telefono`, `correo_electronico`, `direccion`, `tipo_usuario`) VALUES ('25', 'Fulanito', 'perez', '11223344', 'j@gmail.com', 'guatemala', '2')

        public function eliminar($id)
        {
            echo "Id enviado:  ".$id;
            $empleado = new EmpleadosModel();
            $empleado->delete($id);
---
DELETE FROM `empleados`
WHERE `empleado_id` IN ('25')