app/Controllers/EstadiaController.php

    public function index(): string
{

    if(session()->get('staff_id')){
        $estadia = new EstadiaModel();
        $datos['datos'] = $estadia->estadiaLista();

        $datos['datosEmpleados'] = $estadia->findAll();

        $tarifaModel = new \App\Models\TarifaModel();
        $datos['tarifas'] = $tarifaModel->findAll();
        return view('estadiaEmpleados', $datos);
    }else{
        $estadia = new EstadiaModel();
        $datos['datos'] = $estadia->estadiaUsuario(session()->get('usuario_id'));

        $datos['datosEmpleados'] = $estadia->findAll();

        $tarifaModel = new \App\Models\TarifaModel();
        $datos['tarifas'] = $tarifaModel->findAll();
---
SELECT *
FROM `estadia`
SELECT *
FROM `tarifa`

     public function agregarEstadia()
{
    $estadia = new \App\Models\EstadiaModel();
    $tarifa_id = $this->request->getPost('txt_tarifa_id');

    // validar que la tarifa exista
    $tarifaModel = new \App\Models\TarifaModel();
    if (empty($tarifa_id) || !$tarifaModel->find($tarifa_id)) {
        session()->setFlashdata('mensaje', 'Tarifa inválida o no existente.');
        session()->setFlashdata('tipo', 'error');
        return redirect()->to(base_url().'estadia');
    }

    $datos = [
        'tarifa_id'          => $tarifa_id,
        'fecha_hora_entrada' => $this->request->getPost('txt_fecha_entrada'),
        'fecha_hora_salida'  => $this->request->getPost('txt_fecha_salida'),
        'costo'              => $this->request->getPost('txt_costo'),
    ];

    try {
        $insertId = $estadia->insert($datos);
---
SELECT *
FROM `tarifa`
WHERE `tarifa`.`tarifa_id` = '100'
INSERT INTO `estadia` (`tarifa_id`, `fecha_hora_entrada`, `fecha_hora_salida`, `costo`) VALUES ('1', '2025-10-28T12:25', '2025-10-22T12:25', '25.00')