app/Controllers/MarcaController.php

SELECT *
FROM `marcas`
---
    public function index()
    {
        $marca = new MarcasModel();


        $data['marcas'] = $marca->findAll();