app/Controllers/StaffAuth.php

SELECT *
FROM `empleados`
WHERE `correo_electronico` = 'juan.garcia@correo.com'
 LIMIT 1
---
    public function attempt()
    {
        $rules = [
            'txt_correo' => 'required|valid_email',
            'txt_pass'   => 'required|min_length[4]|max_length[100]',
        ];

        if (! $this->validate($rules)) {
            return redirect()->back()
                   ->with('val_errors', $this->validator->getErrors())
                   ->with('toast',['type'=>'danger','msg'=>'Revisá los campos.'])
                   ->withInput();
        }

        $mail = (string)$this->request->getPost('txt_correo');
        $pass = (string)$this->request->getPost('txt_pass');

        $m = new EmpleadosModel();
        $row = $m->where('correo_electronico',$mail)->first();