app/Controllers/TarifaController.php

    public function index()
    {
        $tarifas = new TarifaModel();


        $data['tarifas'] = $tarifas->findAll();
---
SELECT *
FROM `tarifa`