app/Controllers/UsuarioController.php

        public function index(): string
        {
            //Creamos un objeto de tipo UsuariosModel
            $usuario = new UsuariosModel();

            $datos['datos'] = $usuario->findAll();
---
SELECT *
FROM `usuarios`

        public function agregarUsuario()
        {
            $datos = [
                'nit' => $this->request->getPost('txt_nit'),
                'nombre' => $this->request->getPost('txt_nombre'),
                'apellido' => $this->request->getPost('txt_apellido'),
                'direccion' => $this->request->getPost('txt_direccion')
            ];

            // Inserta en la base de datos
            $usuario = new UsuariosModel();
            $usuario->insert($datos);
---
INSERT INTO `usuarios` (`nit`, `nombre`, `apellido`, `direccion`) VALUES ('12345678', 'Juan', 'García', 'Calle 39 Zona 1')

        public function eliminar($id)
        {
            //echo "Id enviado:  ".$id;
            $usuario = new UsuariosModel();
            $usuario->delete($id);
---
DELETE FROM `usuarios`
WHERE `usuario_id` IN ('17')