app/Controllers/VehiculoController.php

    public function index()
    {
        $vehiculoModel = new VehiculoModel();

        $usuarioId = 1;

        $data['vehiculos'] = $vehiculoModel->where('usuario_id', $usuarioId)->findAll();
---
SELECT *
FROM `vehiculos`
WHERE `usuario_id` = 1