app/Models/UsuariosFijosModel.php

SELECT `usuarios_fijos`.*, `usuarios`.`usuario_id`, `usuarios`.`nit`, `usuarios`.`nombre`, `usuarios`.`apellido`, `usuarios`.`direccion`
FROM `usuarios_fijos`
INNER JOIN `usuarios` ON `usuarios`.`usuario_id` = `usuarios_fijos`.`usuario_id`
WHERE `usuarios_fijos`.`no_identificacion` = '3333209671690'
 LIMIT 1
---
    public function findByIdentificacion(string $noIdentificacion): ?array
    {
        return $this->select('usuarios_fijos.*, usuarios.usuario_id, usuarios.nit, usuarios.nombre, usuarios.apellido, usuarios.direccion')
            ->join('usuarios', 'usuarios.usuario_id = usuarios_fijos.usuario_id', 'inner')
            ->where('usuarios_fijos.no_identificacion', $noIdentificacion)
            ->first();